/*
AS-IS
--------------------------------------------------------------------------------------------------------
| Id  | Operation                   | Name           | Starts | A-Rows |   A-Time   | Buffers | Reads  |
--------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT            |                |      1 |    129 |00:00:00.05 |     305 |    185 |
|   1 |  TABLE ACCESS BY INDEX ROWID| T_CUST22       |      1 |    129 |00:00:00.05 |     305 |    185 |
|*  2 |   INDEX RANGE SCAN          | IX_T_CUST22_01 |      1 |    129 |00:00:00.05 |     176 |    185 |
--------------------------------------------------------------------------------------------------------
 
Predicate Information (identified by operation id):
---------------------------------------------------
 
   2 - access("CUST_CD">='150' AND "FLAG"='160' AND "CUST_CD"<='200')
       filter(("FLAG"='160' AND INTERNAL_FUNCTION("DIV"))) 
 


*/

모범답안)인덱스 추가 / SQL 수정
T_CUST22 : FLAG + CUST_CD + DIV

SELECT *
FROM T_CUST22 
WHERE  CUST_CD BETWEEN '190' AND '200' 
------------------------------------------------------
AND   TRIM(DIV) IN ('30', '40', '50', '60', '20')
------------------------------------------------------
AND   FLAG = '160';

/*
--------------------------------------------------------------------------------------------------------
| Id  | Operation                   | Name           | Starts | E-Rows | A-Rows |   A-Time   | Buffers |
--------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT            |                |      1 |        |    130 |00:00:00.01 |     139 |
|   1 |  TABLE ACCESS BY INDEX ROWID| T_CUST22       |      1 |     14 |    130 |00:00:00.01 |     139 |
|*  2 |   INDEX RANGE SCAN          | IX_T_CUST22_03 |      1 |     14 |    130 |00:00:00.01 |       9 |
--------------------------------------------------------------------------------------------------------
 
Predicate Information (identified by operation id):
---------------------------------------------------
 
   2 - access("FLAG"='160' AND "CUST_CD">='190' AND "CUST_CD"<='200')
       filter(("DIV"='20' OR "DIV"='30' OR "DIV"='40' OR "DIV"='50' OR "DIV"='60'))
 


[오답으로 착각할 수 있는 경우]
인덱스 추가
T_CUST22 : FLAG + DIV + CUST_CD  또는  DIV + FLAG + CUST_CD
*/

SELECT /*+ INDEX(A IX_T_CUST22_02) */ *
FROM T_CUST22 
WHERE  CUST_CD BETWEEN '190' AND '200' 
AND   DIV IN ('30', '40', '50', '60', '20')
AND   FLAG = '160'
;

/*
---------------------------------------------------------------------------------------------------------
| Id  | Operation                    | Name           | Starts | E-Rows | A-Rows |   A-Time   | Buffers |
---------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT             |                |      1 |        |    130 |00:00:00.01 |     145 |
|   1 |  INLIST ITERATOR             |                |      1 |        |    130 |00:00:00.01 |     145 |
|   2 |   TABLE ACCESS BY INDEX ROWID| T_CUST22       |      5 |    130 |    130 |00:00:00.01 |     145 |
|*  3 |    INDEX RANGE SCAN          | IX_T_CUST22_02 |      5 |    132 |    130 |00:00:00.01 |      15 |
---------------------------------------------------------------------------------------------------------
 
Predicate Information (identified by operation id):
---------------------------------------------------
 
   3 - access("FLAG"='160' AND (("DIV"='20' OR "DIV"='30' OR "DIV"='40' OR "DIV"='50' OR 
              "DIV"='60')) AND "CUST_CD">='190' AND "CUST_CD"<='200')
*/
