ALTER SESSION SET STATISTICS_LEVEL = ALL;

--1. 인덱스 설계 : 상품번호 + 주문일자
CREATE INDEX YOON.IX_주문집계_68_02 ON YOON.주문집계_68(상품번호, 주문일자);
EXECUTE DBMS_STATS.GATHER_TABLE_STATS('YOON', '주문집계_68');

SELECT  /*+ INDEX(O) */
        주문일자,  SUM(주문금액) 총주문금액
FROM    주문집계_68 O 
WHERE   상품번호 = :PROD_NO
 AND    주문일자 BETWEEN  '20181201'  AND  '20181205'
GROUP BY 주문일자;

/*
-----------------------------------------------------------------------------------------------------------------
| Id  | Operation                    | Name          | Starts | E-Rows | A-Rows |   A-Time   | Buffers | Reads  |
-----------------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT             |               |      1 |        |      5 |00:00:00.01 |    2298 |      3 |
|   1 |  SORT GROUP BY NOSORT        |               |      1 |      5 |      5 |00:00:00.01 |    2298 |      3 |
|   2 |   TABLE ACCESS BY INDEX ROWID| 주문집계_68   |      1 |   6134 |   5000 |00:00:00.01 |    2298 |      3 |
|*  3 |    INDEX RANGE SCAN          | IX_주문집계_68|      1 |   6134 |   5000 |00:00:00.01 |      22 |      3 |
-----------------------------------------------------------------------------------------------------------------
 
Predicate Information (identified by operation id):
---------------------------------------------------
   3 - access("상품번호"=:PROD_NO AND "주문일자">='20181201' AND "주문일자"<='20181205') 
*/


--2. 힌트 : /*+ INDEX_SS(O) */
SELECT  /*+ INDEX_SS(O) */ 
        주문일자,  SUM(주문금액) 총주문금액
FROM    주문집계_68 O 
WHERE   상품번호 = :PROD_NO
 AND    주문일자 BETWEEN  '20181201'  AND  '20181205'
GROUP BY 주문일자
;
/*
-----------------------------------------------------------------------------------------------------
| Id  | Operation                    | Name       | Starts | E-Rows | A-Rows |   A-Time   | Buffers |
-----------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT             |            |      1 |        |      5 |00:00:00.01 |    2308 |
|   1 |  SORT GROUP BY NOSORT        |            |      1 |      3 |      5 |00:00:00.01 |    2308 |
|   2 |   TABLE ACCESS BY INDEX ROWID| 주문집계_68|      1 |   3299 |   5000 |00:00:00.01 |    2308 |
|*  3 |    INDEX SKIP SCAN           | IX_주문집계|      1 |    344 |   5000 |00:00:00.01 |      32 |
-----------------------------------------------------------------------------------------------------

Predicate Information (identified by operation id):
---------------------------------------------------
   3 - access("주문일자">='20181201' AND "상품번호"=:PROD_NO AND "주문일자"<='20181205')
       filter("상품번호"=:PROD_NO)
*/

--3. SQL 수정
SELECT 주문일자, 총주문금액,  ROUND(총주문금액/매장건수) 매장별평균주문금액
FROM   (
        SELECT  주문일자,  SUM(주문금액) 총주문금액, COUNT(DISTINCT 매장번호) 매장건수
        FROM    주문집계_68 O 
        WHERE   상품번호 = :PROD_NO
         AND    주문일자 IN ('20181201', '20181202', '20181203', '20181204', '20181205')
        GROUP BY 주문일자
        )
;
/*
--------------------------------------------------------------------------------------------------------
| Id  | Operation                       | Name       | Starts | E-Rows | A-Rows |   A-Time   | Buffers |
--------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT                |            |      1 |        |      5 |00:00:00.01 |    2305 |
|   1 |  HASH GROUP BY                  |            |      1 |      5 |      5 |00:00:00.01 |    2305 |
|   2 |   VIEW                          | VW_DAG_0   |      1 |    354 |    500 |00:00:00.01 |    2305 |
|   3 |    HASH GROUP BY                |            |      1 |    354 |    500 |00:00:00.01 |    2305 |
|   4 |     INLIST ITERATOR             |            |      1 |        |   5000 |00:00:00.01 |    2305 |
|   5 |      TABLE ACCESS BY INDEX ROWID| 주문집계_68|      5 |   5000 |   5000 |00:00:00.01 |    2305 |
|*  6 |       INDEX RANGE SCAN          | IX_주문집계|      5 |   5000 |   5000 |00:00:00.01 |      30 |
--------------------------------------------------------------------------------------------------------
Predicate Information (identified by operation id):
--------------------------------------------------- 
   6 - access((("주문일자"='20181201' OR "주문일자"='20181202' OR "주문일자"='20181203' OR 
              "주문일자"='20181204' OR "주문일자"='20181205')) AND "상품번호"=:PROD_NO)
*/
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY_CURSOR(NULL, NULL, 'IOSTATS LAST'));
